Tekla Open API Reference for Tekla Structures 2025
DimensionExaggerationAttributes Constructor
Overload List
Name | Description
DimensionSetBaseAttributes.DimensionExaggerationAttributes()
 Creates a new dimension exaggeration attributes instance. The default is to have exaggeration disabled.
DimensionSetBaseAttributes.DimensionExaggerationAttributes(Boolean, DimensionSetBaseAttributes.ExaggerationDirections, DimensionSetBaseAttributes.ExaggerationOrigins, Double, Double, Double)
 Creates a new dimension exaggeration attributes instance with the given parameters.
Top
See Also
Reference
DimensionSetBaseAttributes.DimensionExaggerationAttributes Class
Tekla.Structures.Drawing Namespace